Revit 2027 API
ParameterTypeId.RbsCurvetypePreferredBranchParam Property
 "Preferred Junction Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsCurvetypePreferredBranchParam { get; }
Public Shared ReadOnly Property RbsCurvetypePreferredBranchParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsCurvetypePreferredBranchParam {
	ForgeTypeId^ get ();
}
static member RbsCurvetypePreferredBranchParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace